<a href="https://colab.research.google.com/github/jimmy-io/worksheeets-/blob/master/05_Merge_Auto_MPG_Exercises_with_solutions.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

In [2]:
cars1 = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv")
cars2 = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv")

print(cars1.head())
print(cars2.head())

    mpg  cylinders  displacement  ... Unnamed: 11  Unnamed: 12  Unnamed: 13
0  18.0          8           307  ...         NaN          NaN          NaN
1  15.0          8           350  ...         NaN          NaN          NaN
2  18.0          8           318  ...         NaN          NaN          NaN
3  16.0          8           304  ...         NaN          NaN          NaN
4  17.0          8           302  ...         NaN          NaN          NaN

[5 rows x 14 columns]
    mpg  cylinders  displacement  ... model  origin                 car
0  33.0          4            91  ...    76       3         honda civic
1  20.0          6           225  ...    76       1      dodge aspen se
2  18.0          6           250  ...    76       1   ford granada ghia
3  18.5          6           250  ...    76       1  pontiac ventura sj
4  17.5          6           258  ...    76       1       amc pacer d/l

[5 rows x 9 columns]

In [3]:
cars1 = cars1.loc[:, "mpg":"car"]
cars1.head()

    mpg  cylinders  displacement  ... model  origin                        car
0  18.0          8           307  ...    70       1  chevrolet chevelle malibu
1  15.0          8           350  ...    70       1          buick skylark 320
2  18.0          8           318  ...    70       1         plymouth satellite
3  16.0          8           304  ...    70       1              amc rebel sst
4  17.0          8           302  ...    70       1                ford torino

[5 rows x 9 columns]

In [4]:
print(cars1.shape)
print(cars2.shape)

(198, 9)
(200, 9)

In [6]:
## Join cars1 and cars2 into a single DataFrame called cars

cars = cars1.append(cars2)
cars.head()

    mpg  cylinders  displacement  ... model  origin                        car
0  18.0          8           307  ...    70       1  chevrolet chevelle malibu
1  15.0          8           350  ...    70       1          buick skylark 320
2  18.0          8           318  ...    70       1         plymouth satellite
3  16.0          8           304  ...    70       1              amc rebel sst
4  17.0          8           302  ...    70       1                ford torino

[5 rows x 9 columns]

In [7]:
nr_owners = np.random.randint(15000, high=73001, size=398, dtype='l')
nr_owners

array([62679, 42626, 31090, 21332, 48938, 30216, 69924, 40517, 46092,
       62049, 63134, 28167, 21815, 44164, 58156, 33974, 52803, 65461,
       67223, 25528, 36139, 31131, 71519, 37343, 61452, 47918, 40543,
       60117, 59344, 69081, 23950, 54005, 70649, 57951, 59432, 49122,
       54639, 47868, 17593, 62359, 69534, 41375, 33806, 30360, 48474,
       55709, 58280, 41591, 51388, 54003, 34569, 25563, 71218, 72888,
       30052, 22418, 39437, 39299, 32420, 46787, 34014, 36537, 44217,
       58231, 36385, 16512, 53170, 19345, 28020, 34320, 69636, 59258,
       42238, 46328, 54559, 15761, 36917, 39839, 50026, 51073, 58209,
       30835, 18359, 60173, 64519, 69289, 40554, 15735, 53546, 45859,
       44430, 51738, 39927, 61171, 71654, 50218, 47315, 50038, 39508,
       65858, 55483, 35107, 36272, 65278, 40719, 22447, 62060, 43760,
       41483, 61813, 61082, 42024, 41602, 66056, 32892, 52666, 50617,
       28330, 36002, 68617, 51190, 37063, 65634, 61678, 26362, 48587,
       70761, 22112, 71121, 60227, 30872, 43057, 50173, 58924, 60110,
       37427, 67453, 56699, 42293, 63136, 24571, 72411, 24433, 30605,
       60724, 52377, 41836, 66886, 47857, 16861, 31905, 61472, 31466,
       26362, 35021, 26051, 45132, 70855, 30404, 52354, 21219, 22163,
       54434, 69111, 15017, 52144, 31955, 25902, 62039, 55724, 60817,
       49659, 28038, 40768, 23116, 32898, 50112, 47705, 45092, 70986,
       58208, 61162, 38659, 71039, 27850, 43618, 45664, 47337, 18378,
       32811, 26185, 15152, 44615, 63795, 72675, 71005, 70653, 24718,
       16051, 62911, 68202, 18322, 34710, 66233, 26173, 35641, 23026,
       42082, 67840, 36773, 34302, 60350, 50545, 17717, 18475, 40622,
       28495, 29567, 18082, 37930, 57431, 17591, 44420, 65501, 42540,
       31911, 69124, 46692, 45968, 70656, 28703, 43237, 66375, 57059,
       46011, 59759, 15821, 72604, 15829, 59836, 54038, 66090, 54417,
       51200, 71252, 58090, 69219, 32724, 32388, 43050, 15132, 43805,
       49405, 71921, 56054, 36198, 38859, 67849, 17543, 68819, 33269,
       62380, 30860, 20979, 39594, 52209, 19112, 62087, 33925, 45595,
       67646, 53736, 40379, 66263, 23313, 31691, 31313, 17849, 21552,
       55775, 47612, 47594, 58260, 18963, 17101, 45767, 57383, 65181,
       39618, 64576, 17637, 36925, 64299, 47764, 62159, 29522, 57965,
       40059, 43225, 27063, 38462, 23575, 26937, 42996, 37105, 43042,
       67335, 49768, 62890, 53197, 24847, 37045, 45624, 16177, 69710,
       45572, 35542, 32567, 53661, 72117, 35650, 69440, 61445, 18117,
       15239, 55117, 67994, 66643, 28299, 43625, 50160, 32347, 17366,
       71851, 66207, 23082, 45636, 51454, 31881, 54018, 21740, 19959,
       36770, 18866, 72851, 22225, 45742, 28887, 35752, 64373, 64615,
       19518, 43218, 57915, 36482, 58454, 21006, 66051, 58597, 25628,
       60734, 58046, 39274, 56454, 52462, 32763, 16842, 57047, 63585,
       20772, 32379, 25859, 61716, 23767, 38216, 68784, 44217, 25306,
       68768, 28644, 41526, 72461, 42835, 28898, 26388, 40290, 23400,
       25472, 71522, 54063, 52857, 63623, 37914, 53798, 43030, 65006,
       55098, 31511])

In [8]:
cars['owners']=nr_owners
cars.head()

    mpg  cylinders  displacement  ... origin                        car  owners
0  18.0          8           307  ...      1  chevrolet chevelle malibu   62679
1  15.0          8           350  ...      1          buick skylark 320   42626
2  18.0          8           318  ...      1         plymouth satellite   31090
3  16.0          8           304  ...      1              amc rebel sst   21332
4  17.0          8           302  ...      1                ford torino   48938

[5 rows x 10 columns]